redisTestResult/redisMutiThreadsTestResultFix/redis_test_result_by_memtier_benchmark_F_OFF_1nd/redis_result_Gauss110_F_OFF_P1_1nd_20230719213957.log
20        Threads
5         Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        30445.49          ---          ---         2.98290         2.92700         5.95100         6.39900     32704.19 
Gets         3043.22      3043.22         0.00         2.97648         2.92700         5.95100         6.39900      3254.13 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      33488.71      3043.22         0.00         2.98232         2.92700         5.95100         6.39900     35958.33 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.223        0.000
SET       2.527        5.000
SET       2.591       10.000
SET       2.623       15.000
SET       2.687       20.000
SET       2.767       25.000
SET       2.815       30.000
SET       2.847       35.000
SET       2.879       40.000
SET       2.911       45.000
SET       2.927       50.000
SET       2.943       52.500
SET       2.943       55.000
SET       2.959       57.500
SET       2.975       60.000
SET       2.975       62.500
SET       2.991       65.000
SET       3.007       67.500
SET       3.023       70.000
SET       3.023       72.500
SET       3.039       75.000
SET       3.055       76.250
SET       3.055       77.500
SET       3.071       78.750
SET       3.071       80.000
SET       3.071       81.250
SET       3.087       82.500
SET       3.103       83.750
SET       3.103       85.000
SET       3.119       86.250
SET       3.135       87.500
SET       3.135       88.125
SET       3.151       88.750
SET       3.151       89.375
SET       3.167       90.000
SET       3.167       90.625
SET       3.183       91.250
SET       3.199       91.875
SET       3.231       92.500
SET       3.263       93.125
SET       3.311       93.750
SET       3.343       94.062
SET       3.391       94.375
SET       3.439       94.688
SET       3.487       95.000
SET       3.567       95.312
SET       3.679       95.625
SET       3.967       95.938
SET       4.159       96.250
SET       4.351       96.562
SET       4.927       96.875
SET       5.087       97.031
SET       5.183       97.188
SET       5.247       97.344
SET       5.343       97.500
SET       5.535       97.656
SET       5.631       97.812
SET       5.695       97.969
SET       5.727       98.125
SET       5.791       98.281
SET       5.823       98.438
SET       5.823       98.516
SET       5.855       98.594
SET       5.887       98.672
SET       5.887       98.750
SET       5.919       98.828
SET       5.951       98.906
SET       5.951       98.984
SET       5.983       99.062
SET       6.015       99.141
SET       6.015       99.219
SET       6.047       99.258
SET       6.047       99.297
SET       6.079       99.336
SET       6.079       99.375
SET       6.079       99.414
SET       6.111       99.453
SET       6.111       99.492
SET       6.143       99.531
SET       6.143       99.570
SET       6.175       99.609
SET       6.175       99.629
SET       6.175       99.648
SET       6.175       99.668
SET       6.207       99.688
SET       6.207       99.707
SET       6.207       99.727
SET       6.239       99.746
SET       6.239       99.766
SET       6.239       99.785
SET       6.271       99.805
SET       6.271       99.814
SET       6.271       99.824
SET       6.303       99.834
SET       6.303       99.844
SET       6.303       99.854
SET       6.335       99.863
SET       6.335       99.873
SET       6.367       99.883
SET       6.367       99.893
SET       6.399       99.902
SET       6.431       99.907
SET       6.431       99.912
SET       6.463       99.917
SET       6.463       99.922
SET       6.495       99.927
SET       6.527       99.932
SET       6.559       99.937
SET       6.591       99.941
SET       6.655       99.946
SET       6.687       99.951
SET       6.719       99.954
SET       6.751       99.956
SET       6.751       99.958
SET       6.783       99.961
SET       6.815       99.963
SET       6.847       99.966
SET       6.847       99.968
SET       6.879       99.971
SET       6.911       99.973
SET       6.943       99.976
SET       6.943       99.977
SET       6.975       99.978
SET       6.975       99.979
SET       6.975       99.980
SET       7.007       99.982
SET       7.007       99.983
SET       7.039       99.984
SET       7.071       99.985
SET       7.071       99.987
SET       7.103       99.988
SET       7.103       99.988
SET       7.135       99.989
SET       7.135       99.990
SET       7.167       99.990
SET       7.199       99.991
SET       7.199       99.991
SET       7.231       99.992
SET       7.295       99.993
SET       7.359       99.993
SET       7.391       99.994
SET       7.423       99.994
SET       7.455       99.995
SET       7.455       99.995
SET       7.487       99.995
SET       7.551       99.995
SET       7.647       99.996
SET       7.775       99.996
SET       7.807       99.996
SET       7.903       99.997
SET       8.031       99.997
SET       8.031       99.997
SET       8.063       99.997
SET       8.127       99.997
SET       8.191       99.998
SET       8.191       99.998
SET       8.255       99.998
SET       8.447       99.998
SET       8.511       99.998
SET       8.767       99.998
SET       8.895       99.998
SET       9.087       99.999
SET       9.151       99.999
SET       9.215       99.999
SET       9.215       99.999
SET       9.343       99.999
SET       9.343       99.999
SET       9.407       99.999
SET       9.471       99.999
SET      10.303       99.999
SET      10.367       99.999
SET      10.943       99.999
SET      10.943       99.999
SET      10.943       99.999
[...]
SET      10.943      100.000
SET      13.759      100.000
SET      13.759      100.000
SET      17.023      100.000
SET      17.023      100.000
SET      17.023      100.000
SET      17.407      100.000
SET      17.407      100.000
SET      17.407      100.000
[...]
SET      17.535      100.000
SET      17.535      100.000
SET      17.535      100.000
[...]
SET      20.735      100.000
SET      20.735      100.000
---
GET       0.439        0.000
GET       2.527        5.000
GET       2.575       10.000
GET       2.623       15.000
GET       2.687       20.000
GET       2.767       25.000
GET       2.815       30.000
GET       2.847       35.000
GET       2.879       40.000
GET       2.911       45.000
GET       2.927       50.000
GET       2.943       52.500
GET       2.943       55.000
GET       2.959       57.500
GET       2.975       60.000
GET       2.975       62.500
GET       2.991       65.000
GET       3.007       67.500
GET       3.023       70.000
GET       3.023       72.500
GET       3.039       75.000
GET       3.039       76.250
GET       3.055       77.500
GET       3.055       78.750
GET       3.071       80.000
GET       3.071       81.250
GET       3.087       82.500
GET       3.087       83.750
GET       3.103       85.000
GET       3.119       86.250
GET       3.119       87.500
GET       3.135       88.125
GET       3.135       88.750
GET       3.151       89.375
GET       3.151       90.000
GET       3.167       90.625
GET       3.183       91.250
GET       3.199       91.875
GET       3.215       92.500
GET       3.231       93.125
GET       3.263       93.750
GET       3.295       94.062
GET       3.327       94.375
GET       3.375       94.688
GET       3.407       95.000
GET       3.471       95.312
GET       3.535       95.625
GET       3.711       95.938
GET       4.047       96.250
GET       4.255       96.562
GET       4.575       96.875
GET       5.023       97.031
GET       5.119       97.188
GET       5.215       97.344
GET       5.311       97.500
GET       5.503       97.656
GET       5.599       97.812
GET       5.663       97.969
GET       5.727       98.125
GET       5.759       98.281
GET       5.791       98.438
GET       5.823       98.516
GET       5.855       98.594
GET       5.855       98.672
GET       5.887       98.750
GET       5.919       98.828
GET       5.919       98.906
GET       5.951       98.984
GET       5.983       99.062
GET       6.015       99.141
GET       6.015       99.219
GET       6.047       99.258
GET       6.047       99.297
GET       6.047       99.336
GET       6.079       99.375
GET       6.079       99.414
GET       6.111       99.453
GET       6.111       99.492
GET       6.143       99.531
GET       6.143       99.570
GET       6.175       99.609
GET       6.175       99.629
GET       6.175       99.648
GET       6.207       99.668
GET       6.207       99.688
GET       6.207       99.707
GET       6.207       99.727
GET       6.239       99.746
GET       6.239       99.766
GET       6.271       99.785
GET       6.271       99.805
GET       6.271       99.814
GET       6.303       99.824
GET       6.303       99.834
GET       6.303       99.844
GET       6.303       99.854
GET       6.335       99.863
GET       6.335       99.873
GET       6.367       99.883
GET       6.367       99.893
GET       6.399       99.902
GET       6.431       99.907
GET       6.463       99.912
GET       6.463       99.917
GET       6.463       99.922
GET       6.495       99.927
GET       6.559       99.932
GET       6.591       99.937
GET       6.655       99.941
GET       6.687       99.946
GET       6.751       99.951
GET       6.783       99.954
GET       6.783       99.956
GET       6.815       99.958
GET       6.815       99.961
GET       6.847       99.963
GET       6.879       99.966
GET       6.879       99.968
GET       6.911       99.971
GET       6.943       99.973
GET       6.975       99.976
GET       6.975       99.977
GET       6.975       99.978
GET       7.007       99.979
GET       7.007       99.980
GET       7.007       99.982
GET       7.039       99.983
GET       7.039       99.984
GET       7.071       99.985
GET       7.071       99.987
GET       7.071       99.988
GET       7.071       99.988
GET       7.103       99.989
GET       7.135       99.990
GET       7.199       99.990
GET       7.199       99.991
GET       7.231       99.991
GET       7.391       99.992
GET       7.423       99.993
GET       7.423       99.993
GET       7.423       99.994
GET       7.423       99.994
GET       7.487       99.995
GET       7.487       99.995
GET       8.127       99.995
GET       8.127       99.995
GET       8.127       99.996
GET       8.191       99.996
GET       8.191       99.996
GET       8.191       99.997
GET       8.447       99.997
GET       8.447       99.997
GET       8.447       99.997
[...]
GET       9.151       99.998
GET       9.151       99.998
GET       9.151       99.998
[...]
GET       9.535       99.998
GET       9.535       99.999
GET       9.535       99.999
GET       9.535       99.999
[...]
GET       9.599       99.999
GET       9.599      100.000
---
WAIT      0.000      100.000